papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/blobInTreacle/base/quasiMonolitic/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-0.5 0 -0.5)
    (-0.4 0 -0.5)
    (0.4 0 -0.5)
    (0.5 0 -0.5)
    (-0.3535533906 0.3535533906 -0.5)
    (-0.3 0.3 -0.5)
    (0.3 0.3 -0.5)
    (0.3535533906 0.3535533906 -0.5)

    (-0.5 0 0.5)
    (-0.4 0 0.5)
    (0.4 0 0.5)
    (0.5 0 0.5)
    (-0.3535533906 0.3535533906 0.5)
    (-0.3 0.3 0.5)
    (0.3 0.3 0.5)
    (0.3535533906 0.3535533906 0.5)
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (3 10 1) simpleGrading (1 1 1)
    hex (5 6 7 4 13 14 15 12) (20 3 1) simpleGrading (1 1 1)
    hex (6 2 3 7 14 10 11 15) (10 3 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) (20 10 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 4 (-0.4619397663 0.1913417162 -0.5)
    arc 8 12 (-0.4619397663 0.1913417162 0.5)

    arc 7 3 (0.4619397663 0.1913417162 -0.5)
    arc 15 11 (0.4619397663 0.1913417162 0.5)

    arc 4 7 (0 0.5 -0.5)
    arc 12 15 (0 0.5 0.5)

    arc 1 5 (-0.369551813 0.1530733729 -0.5)
    arc 9 13 (-0.369551813 0.1530733729 0.5)

    arc 6 2 (0.369551813 0.1530733729 -0.5)
    arc 14 10 (0.369551813 0.1530733729 0.5)

    // arc 5 6 (0 0.4 -0.5)
    // arc 13 14 (0 0.4 0.5)
    arc 5 6 (0 0.37 -0.5)
    arc 13 14 (0 0.37 0.5)
);

boundary
(
    fixed
    {
        type patch;
        faces
        (
            (9 8 0 1)
            (1 2 10 9)
            (2 3 11 10)
        );
    }

    interface
    {
        type patch;
        faces
        (
            (8 12 4 0)
            (12 15 7 4)
            (15 11 3 7)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (13 14 15 12)

            (4 5 1 0)
            (7 6 5 4)
            (3 2 6 7)
            (5 6 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
